// XPath (XML Path Language) — це мова запитів,
// яка використовується для навігації по XML-документах і вибору вузлів у дереві XML. 
// XPath також активно застосовується у веб-автоматизації та тестуванні для пошуку елементів
// у HTML-документах.

//Основні синтаксичні конструкції XPath

//- Абсолютний шлях (`/`) — навігація від кореневого елемента.
// /html/body/div

// - Відносний шлях (`//`) — пошук елементів у будь-якому місці документа.
// //div[@class='content']

//- Атрибути (`@`) — звернення до значень атрибутів.
// //input[@id='search']

//- Функції (`text()`, contains(), `starts-with()`) — додаткові умови.
// //a[contains(text(),'Детальніше')]

// - Оператори (`and`, or, `|`) — об'єднання умов.
// //input[@type='text' or @type='email']
  
// - шпаргалка з xpath
//   https://github.com/qa-senpai/test-automation-example/blob/main/cheat-sheets/xpath.md

//Переваги XPath
// - дозволяє знаходити елементи на основі складних умов.
// - підтримує навігацію як у прямому, так і в зворотному напрямку (на відміну від CSS-селекторів).
// - підтримує знаходження елементів за текстовими нодами ([//\*[text()='']])

//Недоліки XPath
// ❌ Повільність — у браузерах XPath працює повільніше за CSS-селектори. (це може бути і плюсом)
// ❌ Крихкість — неправильне використання може призвести до крихких Locator'ів.
// ❌ Складність запису — у порівнянні з CSS-селекторами, XPath-запити можуть бути складнішими.